{"TotalResultsCount":52,"ResultsPage":[{"TutorUserID":72828310,"FirstName":"Meredith","DisplayName":"Meredith D.","ZipCode":"21218","City":"Baltimore","StateAbbreviation":"MD","Headline":"Tutor with Extensive Special Needs Experience","TypicalHourlyRate":75.0,"CancellationPolicyHours":8,"AverageRating":4.95151,"NumberOfRatings":598,"AverageResponseInMinutes":857,"TotalHours":1823,"TravelRadiusInMiles":30,"BackgroundCheckStatusDate":"2013-12-04T23:31:05.14Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/47926eb6-d409-4ae4-9470-54c1c1a28179.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/72828310","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Educational background: \n\nI received my B.S. in Biology with a minor in Physical Science (physics and chemistry) from Bob Jones University in 2005.\n\n\nWork experience:\n\nI have worked as a tutor and teacher for 12 years. During my college career, I tutored college students in biology, chemistry, and algebra. I also tutored high school algebra, chemistry, and biology while I pursued my undergraduate education.\n\nAfter I received my Bachelor's degree, I worked for one year as a high school algebra, chemistry, physics, and physical science teacher for students in 8th-12th grade. I also worked as an after school tutor for 2nd through 12th graders in math and chemistry.\n\nI have extensive experience working with children and adults with special needs. I have worked with individuals who have disabilities and special needs for 14 years in roles including camp counselor, lifeguard, in home support specialist, respite care provider, horseback riding instructor, teacher, and tutor.\n\nI have several years of experience with the IEP process for students with special needs and I greatly enjoy working with children and teenagers with special needs who have focus and attention issues as well as handwriting problems. I am pursuing certification as a handwriting specialist through Handwriting Without Tears for pre-k through cursive handwriting development.\n\nI am also certified at the registered level through the North American Riding for the Handicapped Association (NARHA) as a therapeutic horseback riding instructor, and I have extensive experience working with children and adults with autism, brain injury, cerebral palsy, and developmental disabilities.\n\nTeaching style:\n\nI use a multi-faceted teaching style, realizing that every student is different and every student's needs are unique. I have found through my experience that it is best to combine visual, auditory, and hands-on, experiential teaching methods in order to provide a teaching and learning experience that will grasp the attention of the child and help him or her to retain the learning for life rather than just memorizing it for a test or for one class. Learning is meant to be retained and to be utilized in building skills for life.","RatePolicyDetails":"Discounted rate available for students who refer new students or for groups of 2 or more students.","HasAvailableTimeSlots":true,"UnderGradCollege":"Bob Jones University, B.S. Biology","UnderGradMajor":"Biology","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":113,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":80670200,"FirstName":"Clayton","DisplayName":"Clayton L.","ZipCode":"21227","City":"Halethorpe","StateAbbreviation":"MD","Headline":"Math Tutor","TypicalHourlyRate":60.0,"CancellationPolicyHours":4,"AverageRating":4.93197,"NumberOfRatings":147,"AverageResponseInMinutes":1101,"TotalHours":362,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-09-02T02:41:02.783Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/9563f627-3e05-4405-80de-94a2f5683846.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/80670200","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I have always loved math, and understood why others despise it. My father programmed computers, my mother programmed students as a math teacher. They taught me well and inspired within me a love of learning. The oldest of four spanned over seven years, I was helping my siblings with their homework starting in elementary school. In high school, I coached my middle school's math team because my coach decided he needed more time with his family. I have graduated from UMBC with a B.S. in mathematics, and I plan on teaching at a high school level. I have tutored college students through the university for calculus and precalculus. I know the difference between doing work for a student and actually helping someone learn difficult material. I worked at Mathnasium of Ellicott City, Rockville, and Germantown for two years.  I have thousands of hours of experience teaching math of all levels.  I feel best when I see eyes light up with understanding, and I strive to make that happen every day.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland, Baltimore County","UnderGradMajor":"Mathematics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"Graduate Coursework","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":34,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have tutored calculus while I was in college and at the math learning center where I worked.  I took calculus in one form or another at least six times throughout my schooling career."},{"TutorUserID":86554338,"FirstName":"Craig","DisplayName":"Craig F.","ZipCode":"21209","City":"Baltimore","StateAbbreviation":"MD","Headline":"Mathematician and magician","TypicalHourlyRate":40.0,"CancellationPolicyHours":12,"AverageRating":5.00000,"NumberOfRatings":14,"AverageResponseInMinutes":242,"TotalHours":57,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-10-09T14:36:02.48Z","BackgroundCheckStatus":2,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/5047eb4f-6bc4-4282-9626-2832211c573b.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/86554338","IsProfileVisible":true,"Visibility":1,"FreeResponse":"My ultimate goal as a tutor is to help my students feel comfortable enough with their studies so that they no longer need me to help them anymore.\n\nI am an actuary with 16+ years work experience with the US government. I have taught mathematics and statistics in college, but I enjoy tutoring a lot more than teaching; I don't like having to give grades to students and would much rather help them earn good grades. I have been tutoring mathematics since 1987. I am also a part-time professional magician.\n\nI tutor middle school math, high school math, and most college mathematics and statistics.\n\nThe best way to learn mathematics is by doing mathematics problems. My role as a tutor is similar to that of a coach; the student does the mathematics problem, while I give him or her pointers along the way. Once the student is able to demonstrate that he or she knows how to solve the math problem, I then ask questions to the student in order to facilitate critical thinking. This is in order to ensure that the student actually understands what he or she is doing and isn't just going through the motions.\n\nI am available in the evenings Sunday, Monday, Tuesday, Wednesday, Thursday. Also, I am available during the day on Sunday. I like to meet my students in public libraries, so they can be inspired to do great.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland Baltimore County","UnderGradMajor":"Mathematics","GraduateCollegeOne":"Syracuse University","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"Johns Hopkins University","GraduateCollegeTwoDegree":"Master's","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":14,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have a master's degree in pure math from Syracuse U and a master's degree in applied math from Johns Hopkins U. I am also an actuary who passed all of the exams required for Associate of the Society of Actuaries. Knowledge of calculus is essential for this."},{"TutorUserID":77528900,"FirstName":"Miriam","DisplayName":"Miriam S.","ZipCode":"21236","City":"Nottingham","StateAbbreviation":"MD","Headline":"Experienced Teacher of German and Math: Pre-Algebra through Calculus","TypicalHourlyRate":60.0,"CancellationPolicyHours":6,"AverageRating":4.87500,"NumberOfRatings":40,"AverageResponseInMinutes":null,"TotalHours":85,"TravelRadiusInMiles":8,"BackgroundCheckStatusDate":"2014-11-02T19:31:04.597Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/a1c827e4-036b-48e7-a483-d30bb53d65d2.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/77528900","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a certified secondary math teacher with experience teaching everything from Pre-Algebra through Calculus.  I have taught both middle school and high school in Baltimore County Public Schools and in private schools in the Baltimore area.  I hold a Master's Degree in Curriculum and Instruction.\nI also offer tutoring in German for any age, children through adults for school, travel, or work.\n\nTutoring sessions will be held at a branch of the public library.  I am available evenings and weekends throughout the year.","RatePolicyDetails":"Please ask me about reduced prices for multiple students taking the same course.","HasAvailableTimeSlots":true,"UnderGradCollege":"Virginia Tech","UnderGradMajor":"Engineering","GraduateCollegeOne":"Loyola University--Baltimore MD","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":10,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have 3 years of experience teaching AP Calculus AB.  I can tutor you to be more successful in your high school calculus class or just help you review for the AP Calculus AB exam."},{"TutorUserID":79996710,"FirstName":"Keith","DisplayName":"Keith L.","ZipCode":"21146","City":"Severna Park","StateAbbreviation":"MD","Headline":"Professor available to tutor in Math, Science and Engineering","TypicalHourlyRate":85.0,"CancellationPolicyHours":5,"AverageRating":4.98138,"NumberOfRatings":376,"AverageResponseInMinutes":5,"TotalHours":876,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/031f0038-5389-4de0-882c-60db62f2f63a.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/79996710","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a 60 year-old Mechanical Engineering Professor at the U.S. Naval Academy.  I have a PhD in mechanical engineering from the University of Maryland.  I have 8 years of teaching experience at the University of Maryland and 31 years at the U.S. Naval Academy.  As a Professor, I have hundreds of hours of experience working with students one on one as well as countless hours of tutoring my own very successful children when they were young.\n\nRecently, I have had great success helping students significantly improve their Math SAT scores.  I am willing to tutor any math class, K-12, any calculus class, math SAT prep, math ACT prep and some college classes such as Statics, Dynamics, and Thermodynamics.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland","UnderGradMajor":"Mechanical Engr","GraduateCollegeOne":"University of Maryland","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"University of Maryland","GraduateCollegeTwoDegree":"PhD","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":90,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"As an engineering professor, I use calculus often and provide one to one tutoring to my engineering students."},{"TutorUserID":85364927,"FirstName":"John","DisplayName":"John T.","ZipCode":"21043","City":"Ellicott City","StateAbbreviation":"MD","Headline":"Doctoral-level tutoring for Maths, Stats, Sciences, SAT/ACT, and GRE","TypicalHourlyRate":65.0,"CancellationPolicyHours":4,"AverageRating":4.92427,"NumberOfRatings":647,"AverageResponseInMinutes":234,"TotalHours":2220,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-03-30T12:11:03.357Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/61550638-35a5-4dfe-a78a-8edde8f01c22.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/85364927","IsProfileVisible":true,"Visibility":1,"FreeResponse":"*****************************************************\nLimited availability right now. The availability I have on the site\nis up-to-date. Contact me for details.\n*****************************************************\n\nJohn has a passion for working with people who endeavor to learn and develop their intellects and is listed among the Wyzant Top 100 Tutors for 2015.\n\nBackground: John grew up in Northeast Kansas working on farms since the age of 11. He graduated from a small rural high school and earned his BS and PhD degrees in biological sciences from the University of Kansas. An award-winning instructor, John taught extensively on the undergraduate and graduate level during his PhD program. While a Cancer Prevention Fellow with the National Cancer Institute, John earned his Master of Public Health degree from Johns Hopkins University. As a Fellow, John completed four years of mentored research in the NCI's Laboratory of Metabolism where he applied mass spectrometry-based metabolomics to radiation biomarker development. He then joined the faculty of the Department of Biochemistry and Cellular & Molecular Biology at the Georgetown University. During these years, John was recognized multiple times for the quality of his research. His seminal publications in radiation metabolomics research have been cited over 400 times in the peer-reviewed literature. \n\nCurrently: John works as a public health research consultant and also tutors extensively. Since his start in November 2013, he logged nearly 500 hours of one-on-one tutoring with StudyPoint Inc. Before leaving the company to work independently, John was promoted to the distinguished level of Tutor Premiere. John is now writing advanced study guides for the ACT, SAT, and GRE, based on his more than 1,000 hours of one-on-one test prep tutoring experience. He currently teaches SAT and ACT classes at a test prep academy in Ellicott City. \n\nJohn's philosophy is based on creating and maintaining a healthy lifestyle of learning. \"How we spend our time determines what we are good at. If we spend our time on entertainment, then we will be great at being entertained. But if we spend our time solving problems, then we will become extraordinary problem-solvers.\" John takes a holistic approach to tutoring by addressing habits and lifestyle as well as academic performance. John always begins a tutoring relationship by learning about his students' habits and lifestyles and offering recommendations for changes. Establishing an optimal lifestyle of learning is foundational to achieving academic excellence.\n\nIn his \"copious\" free time, John enjoys being with his two children (above all else), studying theology and philosophy, volunteering to help the poor, and riding his bicycles and motorcycles. His ultimate mission is to leave a strong legacy of contribution for not only his own kids but all children and adults engaged in the pursuit of knowledge.","RatePolicyDetails":"Minimum 60 min session to ensure I can defray travel costs. Discount for online sessions.","HasAvailableTimeSlots":true,"UnderGradCollege":"University of Kansas","UnderGradMajor":"BS, Organismal Biology","GraduateCollegeOne":"University of Kansas","GraduateCollegeOneDegree":"PhD","GraduateCollegeTwo":"Johns Hopkins University","GraduateCollegeTwoDegree":"Master's","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":185,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":85317911,"FirstName":"Doug","DisplayName":"Doug H.","ZipCode":"21043","City":"Ellicott City","StateAbbreviation":"MD","Headline":"Math, Physics and Computer Science tutoring by Stanford grad","TypicalHourlyRate":50.0,"CancellationPolicyHours":1,"AverageRating":4.98511,"NumberOfRatings":403,"AverageResponseInMinutes":54,"TotalHours":878,"TravelRadiusInMiles":5,"BackgroundCheckStatusDate":"2015-04-27T03:21:04.073Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/cea9461e-2606-439a-869c-f614f82ed85f.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/85317911","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Looking for extra help with high school math or physics, or college computer science?  Perhaps that AP Calculus exam is looking like a challenge, or your son or daughter would like to improve their SAT scores?   I have helped a number of local students make sense of math or physics...check out my reviews and ratings.  It's so great when I hear my students tell me they got an A on a big test, a 5 on an AP exam, a 1440 on their SAT, or they passed that hard mandatory class for their major.  I have a Master's in Computer Science from Stanford, and enjoy helping people learn about math and computer science, as well as related subjects like physics and SAT prep.  \n\nMy specialties include high school honors and AP classes like calculus and physics, as well as college  classes for discrete math, computer architecture, algorithms and programming.   If you find yourself struggling with a challenging math class or challenging teacher, or just need a refresher in algebra, geometry,  trigonometry,  probability and statistics, or precalc to get through more advanced math, I would be a great choice to help you.  My students appreciate my  approach with lots of patience and positive reinforcement.   \n\nI have a flexible schedule, and can meet you or your student after school, or during the day if that's more convenient.  Most of my students meet with me either at the  library or in their home.  At this point, I have a number of regular weekly clients who get priority for future appointments, so not all times shown in the availability list below are schedulable for new clients, but I would be happy to work with you to find a time that would work for you.\n\nMy preference is to work with students who want to improve performance in a class or for a standardized test over a series of regular sessions, as opposed to one-time help for a class assignment or test.   You might reasonably expect a one-letter grade improvement from weekly meetings over an eight week period; of course, that varies with the student, subject, and situation, so is a goal rather than a guarantee.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Michigan","UnderGradMajor":"Computer Engineering","GraduateCollegeOne":"Stanford","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":120,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"Calculus is one of the most popular choices for my students, particularly AP AB and honors calculus involving the mathematics of the infinitesimal: limits, derivatives, integrals, and related topics like exponential and logarithmic functions.   I have worked with many students to help them get through quizzes, midterms, finals and the AP exam.  I would be happy to help you, too!"},{"TutorUserID":85487170,"FirstName":"Nikia","DisplayName":"Nikia K.","ZipCode":"21057","City":"Glen Arm","StateAbbreviation":"MD","Headline":"Patient Teacher for Mathematics","TypicalHourlyRate":42.0,"CancellationPolicyHours":3,"AverageRating":4.88608,"NumberOfRatings":79,"AverageResponseInMinutes":162,"TotalHours":279,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2015-03-10T22:31:05.253Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/e79a6ebc-a1ef-4d28-a765-34e1ddc14214.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/85487170","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a secondary mathematics teacher with an advanced professional teaching certificate and six years of experience. I also have eleven years of tutoring experience. As an undergraduate student, I took on tutoring as a part time job and I have loved tutoring ever since. It brings me joy to share my knowledge with students and to experience the \"ah ha!\" moments with them as concepts begin to make sense.\r\n\r\nMy specialty is in tutoring various levels of mathematics. Whether we are working on basic math or differentiating functions, my goals are to ease each student into the content and challenge them all while minimizing any possible anxiety. My priority in each session is to ensure the student's success. Prior to meeting with each student, I like to gather information about strengths, weaknesses and goals for the purpose of maximizing time during each session. I am attentive, patient, and will work through each problem until the student feels comfortable and confident enough to work independently. \r\n\r\nTutoring is my passion and I look forward to helping you reach your goals.","RatePolicyDetails":"A one hour session fee will be assessed to the student's account in the event the session is cancelled with less than 3 hours notice.","HasAvailableTimeSlots":true,"UnderGradCollege":"Morgan State University, Baltimore, Maryland","UnderGradMajor":"Mathematics","GraduateCollegeOne":"Towson University Towson MD","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":17,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":76086620,"FirstName":"Ryan","DisplayName":"Ryan N.","ZipCode":"21044","City":"Columbia","StateAbbreviation":"MD","Headline":"Math and Stat tutoring from elementary to college-level concepts","TypicalHourlyRate":60.0,"CancellationPolicyHours":8,"AverageRating":4.91028,"NumberOfRatings":457,"AverageResponseInMinutes":78,"TotalHours":1676,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-08-18T14:06:03.413Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/8a4f3f52-dc96-4e18-9738-1ebcebe322d9.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/76086620","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I completed a Bachelor's degree in statistics at North Carolina State University in May 2010, and proceeded to take a few graduate mathematics and statistics courses.  Tutoring has been my primary focus since 2011.  I have tutored mathematical subjects ranging from elementary math to calculus (univariate and multivariate), linear algebra, differential equations, real analysis, and advanced statistics courses (e.g. mathematical statistics, biostatistics, machine learning, advanced probability), and have tutored ages ranging from very young children to nontraditional adult students.\n\nAside from math and statistics, I have also taught guitar performance and music theory at the Burton School of Arts from 2008-2011, and I am looking to begin tutoring English, composition, and rhetoric at the high school level. \n\nI empathize with students who are frustrated with mathematical coursework and concepts, and incorporate a supportive manner in my teaching style. This applies especially to students with learning disabilities, or otherwise unique learning styles that may be less compatible with a traditional classroom learning environment.  If you are frustrated and feel that you simply can't grasp these concepts, rest assured that it is possible, and having someone work one-on-one with you will help address your specific concerns and weaknesses.  Often, it's just a matter of having someone explain the concepts in a different way, then walking you through a few examples.\n\nThanks for looking at my profile, and I hope you'll give me a chance to help you!","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"North Carolina State University","UnderGradMajor":"Statistics","GraduateCollegeOne":"North Carolina State University","GraduateCollegeOneDegree":"Graduate Coursework","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":164,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":84504010,"FirstName":"Jessica","DisplayName":"Jessica H.","ZipCode":"21228","City":"Catonsville","StateAbbreviation":"MD","Headline":"Science, Math, and Engineering ","TypicalHourlyRate":40.0,"CancellationPolicyHours":10,"AverageRating":4.90476,"NumberOfRatings":42,"AverageResponseInMinutes":609,"TotalHours":123,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":"2015-09-08T01:46:04.55Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/82f51bb4-10eb-4bb8-b0a1-50971c312707.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/84504010","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I have been tutoring ever since I was a freshman in high school. I had the opportunity to tutor kids at my local church with Vietnamese and English for 2 years. Also, I was involved in National Honor Society, specifically in the tutoring committee. I had tutor several students after school. All of the students that I tutored had told me that their scores on tests improved. \n\nWe all learn in different ways. Some of us learn through visual, or hearing, or touching, or all three combinations. It is my responsibility to determine which method best suited for each student and to teach them best strategies in order to achieve their full academic potential. \n\nI always encourage students to do better by saying \"You can do this! I believe in you!\". I feel very satisfied when students understand concepts that they have troubled with because this makes me know that I am doing my job right. I love watching students grow and become more confident as mathematicians, writers, problem solvers, and people. \n\nI took a lot of AP Classes during my high school career, such as AP Chemistry, AP Calculus AB/BC, AP Psychology, AP American Government, and so on. I have a lot of knowledge and willingly to share with you! I graduated from Harford Community College with Associates Degree of Science in Engineering. I'm transferring to University of Maryland, Baltimore County in Spring 2016 for Chemical Engineering. I'm very flexible with my tutoring schedule and you can cancel the tutor session within 10 hour ahead of notice. Please contact me for more detail!","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"UMBC (University of Maryland, Baltimore County)","UnderGradMajor":"Chemical Engineering","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":15,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":80031850,"FirstName":"Leah","DisplayName":"Leah C.","ZipCode":"21045","City":"Columbia","StateAbbreviation":"MD","Headline":"Experienced Tutor Specializing in Higher Level Math ($35 - $65/hr)","TypicalHourlyRate":35.0,"CancellationPolicyHours":24,"AverageRating":4.92131,"NumberOfRatings":305,"AverageResponseInMinutes":259,"TotalHours":1046,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":"2015-05-09T20:56:03.61Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/0a5e6f97-ccca-4bf1-9e2a-a69fe5de464e.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/80031850","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Note: I tutor students online in college level math (statistics is a favorite!) and test prep from all over the east coast. I also tutor local students at the Columbia and Ellicott City area libraries.  I am currently accepting in-person and online students Monday - Friday 9 AM - 3 PM.\n\nI am a \"jack of all trades\" tutor with the quality of a specialist.  I specialize in high school and college level math, but have tutored grade school reading and math and high school science as well.  I help with test prep, including GRE and SAT prep.  My background is extensive--I graduated salutatorian of my high school class, am a member of Alpha Sigma Nu--Jesuit Honors Society, and I hold both a degree in engineering from Loyola College in Maryland and a Masters in the Art of Teaching from Towson University.  It only took a year as an engineer to realize that, while I was a good engineer, it was not my passion.  I became a high school math teacher and taught for 3.5 years--until the birth of my son in 2010.  Now I continue that passion through tutoring.  \n\nI have been tutoring for 7 years. I love inspiring students to do their best, and I enjoy working with the wide age range that I have been privileged to work with.  I have tutored Kindergartners, grade-school children, teens, and adults and have been successful with and enjoyed every age group.   \n\nMy tutoring style can be summed up in one word: passion.  I have a lot of energy and joy with which I deliver my lessons.  I am about as patient a person as you can find and also very positive.  My educational background and experience both as a personal tutor and tutor for leading tutoring companies in the area show that I have more to bring to the table than just a great personality.  \n\nI can't wait to be the difference you've been waiting for.  Do not hesitate to contact me!  I look forward to working with you.","RatePolicyDetails":"Online tutoring and in-person 2-on-1 (2 students at a time) is $35/hr.  I offer private tutoring for $50/hr or $65/hr--please inquire about details.","HasAvailableTimeSlots":true,"UnderGradCollege":"Loyola College (MD)","UnderGradMajor":"BSES--Engineering","GraduateCollegeOne":"Towson University, Towson , MD","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":70,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I majored in Engineering in college, so Calculus was something I used on a daily basis for 4 years.  Since college I have tutored both high school and college students in Calculus to keep my skills fresh.  It is my favorite of the math classes to work with although it is certainly the most challenging (second to statistics) for students taking it!  "},{"TutorUserID":76276800,"FirstName":"Joe","DisplayName":"Joe P.","ZipCode":"21146","City":"Severna Park","StateAbbreviation":"MD","Headline":"Experienced Calculus Instructor","TypicalHourlyRate":60.0,"CancellationPolicyHours":24,"AverageRating":4.92929,"NumberOfRatings":297,"AverageResponseInMinutes":403,"TotalHours":875,"TravelRadiusInMiles":0,"BackgroundCheckStatusDate":"2014-01-21T15:56:10.07Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/a3f9385a-7b29-49d5-a8e3-21caa8367490.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/76276800","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I previously taught at the United States Naval Academy from Jan 2009 to Dec 2012 as an Adjunct Instructor/Tutor teaching Calculus I and tutoring Pre-Calc, Calc I, Calc II, Statics, and the Aviation Selection Test Battery (ASTB - a standardized test required for those who want to fly in the Navy/Marine Corps).  My last assignment in the Navy before retiring in 2009 was as the Director of Professional Tutoring at the United States Naval Academy, where I supervised 8 Masters/PhD level tutors, taught Learning Skills (Time Management, Note Taking, Test Taking, etc.), and tutored Calc I, Statics and the ASTB.  Additionally, I coached high school volleyball for 10 years in Anne Arundel County, and tutored some of my players over the years in Algebra II, Pre-Calc, and Calculus.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"United States Naval Academy","UnderGradMajor":"General Engineering","GraduateCollegeOne":"Loyola College in Maryland","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":90,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I taught as an Adjunct Instructor at the United States Naval Academy teaching Calculus 1. And I was also employed by the Naval Academy as a tutor for Precalculus, Calculus I, and Calculus II.  I continue to teach one section of Supplemental Instruction for Calculus I at the Naval Academy, a non-graded voluntary course for those who wish additional help for their graded Calculus I course."},{"TutorUserID":77407670,"FirstName":"Michael","DisplayName":"Michael H.","ZipCode":"21043","City":"Ellicott City","StateAbbreviation":"MD","Headline":"High School Math, Physics, Computer Science & SAT/GRE/AP/PRAXIS Prep","TypicalHourlyRate":60.0,"CancellationPolicyHours":6,"AverageRating":4.78680,"NumberOfRatings":197,"AverageResponseInMinutes":475,"TotalHours":1492,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":"2014-10-09T03:01:11.813Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/147e5aef-db8e-4202-a0bb-10512e17823e.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/77407670","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I tutor Mathematics, Physics, and Computer Science.  My students range from the Elementary to the PhD level.\n\nSince 2007, tutoring has been a passion for me.  My interest in learning is infectious, and my tutoring style is both friendly and engaging.\n\nI joined WyzAnt.com in the Spring of 2011, and since then have tutored nearly full time. My students range in age from 8 to 38.  In each case, they sought to fill gaps that their classes left behind.  Traditional education offers a one-size-fits-most model.  The students who benefit the most from tutoring are those who fall outside that model. \n\nMy BS degree was earned at the Florida Institute of Technology in Physics, and I have two Masters degrees: one in Mathematics and the other in Physics.  They were obtained from the University of Maryland and from Johns Hopkins University.  My teachers were some of the best in the country, and I've adopted their excitement and dynamism to my teaching style.\n\nIn Mathematics, my tutoring experience includes: \n- Arithmetic\n- Pre-algebra\n- Algebra I & II\n- Plane & Analytic Geometry\n- Trigonometry\n- Probability & Statistics\n- Number Theory\n- Calculus\n- Differential Equations -- Ordinary and Partial\n- Real & Complex Analysis\n- Numerical Analysis\n\nIn the Sciences, my tutoring experience includes:\n- Physics (Mechanics, Thermodynamics, Optics, Electricity & Magnetism)\n- High School Chemistry (Inorganic only)\n\nIn Computer Science, my tutoring experience includes:\n- Programming languages:  Perl, Python, Java, and the R Statistical Programming Language\n- Algorithms and Data Structures\n- Linux, especially training for certifications such as the LPI and RHCE\n\nNeed help with Microsoft Word or Excel? Then I'm the one for you, especially if you need help with  Pivot Tables!\n\nNeed help preparing for the SAT, GMAT, GRE, GED, or for class tests?  Recently, I took the SAT test and was awarded a combined score that placed me in the top 97% of test takers. On the PRAXIS tests -- required for new teachers – I scored in the top 15% of fellow test takers on both the Mathematics and Physics Content Subject tests.\n\nPursuing Advance Placement?  I've tutored students taking:\n- AP Calculus\n- AP Physics\n- AP Computer Science\n- AP Statistics\n\nNeed help in advanced areas?  My tutoring experience includes these subjects and using these textbooks:\n\nBiology – O'Reilly's Perl Programming for Bioinformatics\nDiscreet Mathematics – Epp's Discrete Mathematics with Applications\nStatistical Programming – Muenchen's R for SAS and SPSS Users\n\nTutoring is usually conducted in your home, a library, or a café.  If the student has access to the Wyzant account, on-line tutoring is available, too.\n\nI look forward to hearing from you.","RatePolicyDetails":"60 minute minimum for each session.\nA discount is available for multiple clients at the same session or back-to-back.","HasAvailableTimeSlots":true,"UnderGradCollege":"Florida Institute of Technology, Melbourne, FL","UnderGradMajor":"Physics","GraduateCollegeOne":"Johns Hopkins","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"University of Maryland at Baltimore County","GraduateCollegeTwoDegree":"Master's","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":160,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":86898558,"FirstName":"Elizabeth","DisplayName":"Elizabeth H.","ZipCode":"21218","City":"Baltimore","StateAbbreviation":"MD","Headline":"Studying Mechanical Engineering with great tutoring experience","TypicalHourlyRate":35.0,"CancellationPolicyHours":24,"AverageRating":null,"NumberOfRatings":0,"AverageResponseInMinutes":null,"TotalHours":0,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/526e95ea-1497-415a-8ea3-e1c8b8f95956.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/86898558","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I'm currently a junior studying Mechanical Engineering and Mathematics at Johns Hopkins University. I have been tutoring since I was in middle school in a variety of subjects from English to math to the ACT's. I first tutored my brother back when I was in elementary school and then joined a tutoring program in middle school where I had three students. In high school, I had several students, one of whom I still meet with when I'm home from college, where I tutored them in several levels of math. \r\n\r\nI have taken several college level courses in math such as Linear Algebra to Differential Equations and excelled in them. I scored a perfect math score on the ACT. I can tutor in all levels of algebra, calculus, and elementary math.\r\n\r\nPlease contact me if you need any form of help in math. I'll do my best to make sure you both understand and excel in the subject.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Johns Hopkins Unviersity","UnderGradMajor":"Mechanical Engineer","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":0,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":null,"MatchingSearchedForSubjectName":null,"MatchingSearchedForSubjectQualification":null},{"TutorUserID":81416210,"FirstName":"Kevin","DisplayName":"Kevin F.","ZipCode":"21230","City":"Baltimore","StateAbbreviation":"MD","Headline":"Math Expert with Real-World Experience","TypicalHourlyRate":60.0,"CancellationPolicyHours":12,"AverageRating":4.97744,"NumberOfRatings":133,"AverageResponseInMinutes":null,"TotalHours":249,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":"2014-05-20T19:06:09.353Z","BackgroundCheckStatus":2,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/4e328eed-f899-47d6-8aa1-687b0d3745c9.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/81416210","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am an engineer with an MS in Electrical Engineering who is passionate about mathematics AND (more importantly) its applications to real-world problems.  From my engineering undergraduate and graduate coursework, I am familiar with and comfortable explaining Algebra, Calculus, Linear Algebra and Differential Equations as well as Physics.  I am patient and professional with students, and will go the extra mile to make sure students have a physical “feel” for the math they’re learning as well as a general approach to solving problems.\n\nAs an Electrical Engineering graduate student at Lehigh University I had the opportunity to gain experience working with students of different skill levels.  I lead two lectures a week teaching a math-intensive introductory circuits course.  In addition to leading lectures, I spent considerable time leading electronics labs, helping students apply their textbook knowledge to real circuits.  In my free time, I was also a volunteer for Lehigh’s STAR tutoring service as a math and science tutor for Bethlehem, PA area middle school and high school students.\n\nAfter finishing my MS at Lehigh in 2011, I earned an engineering position at the Johns Hopkins Applied Physics Laboratory, where I currently work.  I enjoyed the opportunities I had to interact with students to help them understand difficult material, and miss the “Aha!” moments we were able to share when I helped solidify a concept they previously struggled with.","RatePolicyDetails":"I offer a $10/hour discount for those willing to meet at the Enoch Pratt Free Library on Light Street in Baltimore.","HasAvailableTimeSlots":true,"UnderGradCollege":"Lehigh University (Bethlehem Pa)","UnderGradMajor":"Mechanical Engr","GraduateCollegeOne":"Lehigh University (Bethlehem Pa)","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"University of Maryland, College Park","GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":15,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have taken and earned A's in Calculus 1, 2, and 3 at Lehigh University.  As an engineer, I am forced to rely on these basics to accomplish my job on a day-to-day basis.  I am familiar with and have tutored each level of calculus at a university level."},{"TutorUserID":86400425,"FirstName":"Alisha","DisplayName":"Alisha V.","ZipCode":"21218","City":"Baltimore","StateAbbreviation":"MD","Headline":"Undergraduate Student at Johns Hopkins University","TypicalHourlyRate":35.0,"CancellationPolicyHours":3,"AverageRating":5.00000,"NumberOfRatings":12,"AverageResponseInMinutes":802,"TotalHours":22,"TravelRadiusInMiles":5,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/74e48d9c-e670-4792-a0c6-85c9bcf7b0ea.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/86400425","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I started tutoring algebra and geometry during my freshman year of high school. At that time, I was taking a pre-calculus course, and decided to use my knowledge to help classmates through my high school's peer tutoring program. Once I realized how much I enjoyed helping my peers succeed in their math classes, I applied to work as a teaching assistant for a tutoring program specializing in advancing students' mathematics and reading comprehension skills. Since then, I have helped instructors develop customized lesson plans for students and have guided students not only in their coursework but also in test prep and extracurricular skills such as public speaking and essay writing.\n\nI took AP Calculus AB and BC, and scored a 5 on both the AP exams. On ACT math, I scored 36/36 and on SAT math I scored 770/800. I took the SAT Math II subject test and scored 760/800.\n\nI'm a sophomore at Johns Hopkins University and I'm generally pretty flexible, just let me know what days and times work best for you.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Johns Hopkins University","UnderGradMajor":"Molecular Biology","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":4,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":null,"MatchingSearchedForSubjectName":null,"MatchingSearchedForSubjectQualification":null},{"TutorUserID":86200784,"FirstName":"Mike","DisplayName":"Mike S.","ZipCode":"21212","City":"Baltimore","StateAbbreviation":"MD","Headline":"Johns Hopkins Ph.D. Offers Ed. in Physics, Math, SAT, GRE, and More","TypicalHourlyRate":57.0,"CancellationPolicyHours":6,"AverageRating":4.91667,"NumberOfRatings":12,"AverageResponseInMinutes":387,"TotalHours":51,"TravelRadiusInMiles":3,"BackgroundCheckStatusDate":"2016-02-04T23:56:03.763Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/aab357f2-c53e-4722-8709-d211475edb79.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/86200784","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Hi, my name is Mike!  I'm new to WyzAnt, but have been a science and mathematics teacher in the Baltimore area for the past ten years.  I have experience working with students of all levels from grade school (as a course instructor for the Center for Talented Youth program, for example) through high school (through independent tutoring with many local private schools for AP exams, SATs, science courses, etc.) and college (e.g. course instructor at JHU, MCAT instructor through Princeton Review).  I have also helped professionals strengthen and sharpen their skills.\n\nI started teaching college debate while in school in Boston and then transitioned into a (mostly) private physics and mathematics tutor in Baltimore after beginning graduate school.  I enjoy tutoring a great deal, and so decided to continue after completing my Ph.D. in astrophysics.\n\nI am a student of educational theory and have traveled across the country attending talks on effective methods of science education.  I understand that students learn best when they actively engage the material.  For that reason, my tutoring approach is a combination of lecturing to introduce the main concepts, followed by a period of directed inquiry.  My goal is to help students cultivate a mathematical/scientific mindset through which they don't simply arrive at correct answers by memorizing equations, but discover entire classes of solutions to be self-evident given more fundamental principles.\n\nI also understand that tutoring services can be expensive.  As someone who grew up without access to great educational resources, I can certainly empathize.  As a result, I personally work to ensure that my tutoring services are both accessible and efficient.  After all, it's not about how many hours you work at something; it's about how smartly you work at it.\n\nPlease don't hesitate to contact me with any questions you may have.  If you believe that some aspect of my services is a limiting factor for you, please send me a message and I'd be happy to discuss further.  All the best!","RatePolicyDetails":"I can offer discounts for students working in groups.  This arrangment is often beneficial, as useful questions and discussions created by one student frequently benefit the others.","HasAvailableTimeSlots":true,"UnderGradCollege":"Boston University","UnderGradMajor":"Physics andAstronomy","GraduateCollegeOne":"Johns Hopkins University","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"Johns Hopkins University","GraduateCollegeTwoDegree":"PhD","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":12,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":85816293,"FirstName":"Justin","DisplayName":"Justin B.","ZipCode":"21239","City":"Baltimore","StateAbbreviation":"MD","Headline":"Professor with many years of teaching experience","TypicalHourlyRate":75.0,"CancellationPolicyHours":24,"AverageRating":null,"NumberOfRatings":0,"AverageResponseInMinutes":null,"TotalHours":0,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://www.wyzant.com/images/tutor/silhouette.png","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/85816293","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I have been teaching math at the college level for about 9 years. I enjoy working with people and have often been described as patient.  I have taught math in both large univeristies and small colleges; besides knowing the subject I have spent a lot of time thinking about how people learn and how I can help them with learning.\n\nI think tutoring one on one gives me a great opportunity to help students really learn the material because I can really get a sense of where a student is and where they're stuck.  My experience is that people often struggle with math because they get stuck on some little things and aren't able to go on from there.  I think working one on one with you I'll be able to find those places and help you get past them.  I believe in trying to help students gain mastery of both the concepts and techniques for whatever math they're doing.\n  \n\nI look forward to working with you!","RatePolicyDetails":null,"HasAvailableTimeSlots":false,"UnderGradCollege":"UMBC","UnderGradMajor":"Math and Comp Sci","GraduateCollegeOne":"University of Maryland, College Park","GraduateCollegeOneDegree":"PhD","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":0,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":82411210,"FirstName":"Emmanuel","DisplayName":"Emmanuel Y.","ZipCode":"21239","City":"Baltimore","StateAbbreviation":"MD","Headline":"Expert and dedicated tutor in science and mathematics","TypicalHourlyRate":30.0,"CancellationPolicyHours":null,"AverageRating":2.00000,"NumberOfRatings":1,"AverageResponseInMinutes":338,"TotalHours":5,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/cee4a7be-0529-4aa7-a2d7-47e1741e1db0.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/82411210","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a 2011 graduate of Morgan State University with a degree in Biology(Pre-Med). I have tremendous experience in tutoring which goes way back to high school where I was the class captain and was required as part of my duties to tutor my mates who had difficulties in certain subjects. The satisfaction that comes with being able to help my fellow students excel in their challenging subject areas spurred me to continue tutoring while in college. \r\n\r\nThroughout my tutoring career, I have been able to identify key reasons why some subjects appear challenging to students. I have realized that some students become easily distracted in class and therefore miss the salient concepts being taught while others have bad note-taking skills which negatively impacts their learning and comprehension ability. In other cases however, teachers do not have enough time to fully explain difficult concepts or oversimplify a topic and later give relatively difficult tests. Since each student's case is unique, I develop a personalized approach that suits the learning style of the tutee. \r\n\r\nWhen I tutor in subjects like mathematics, I make sure that I thoroughly explain each step and clarify any questions then I make the tutee explain it back to me in their own terms. By doing so, I can determine whether the tutee has fully understood the concept being taught and is confident on solving similar problems correctly. Also, I spend significant amount of time solving problems and explaining common caveats that confuses students. I also give a lot of assignments to build confidence in challenging topics. When I tutor in the sciences such as biology, organic and inorganic chemistry, and physics, I rely greatly on study aids such as youtube videos, illustrations, flashcards, mnemonics, and everyday experiences to clarify concepts. I believe that mnemonics and identity words are the surest way to remember very detailed concepts. \r\n\r\nAs such, I help the tutee come out with familiar mnemonics that can help in memorization. I also help prepare students for their standardized exams such as SAT, ACT and GMAT.I am a strong believer in the maxim practice makes perfect so I am relentless on practicing a lot of questions. I have experience in tutoring from the elementary level up to the university level and my tutees witness significant increase in their grades. I am therefore looking forward to helping you achieve excellent grades in your challenging courses and helping you develop learning strategies that will benefit you in your educational career. ","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Morgan Sate University","UnderGradMajor":null,"GraduateCollegeOne":null,"GraduateCollegeOneDegree":"Other","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":3,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":80585030,"FirstName":"Khaled","DisplayName":"Khaled A.","ZipCode":"21227","City":"Halethorpe","StateAbbreviation":"MD","Headline":"Private Math Tutor Avaliable","TypicalHourlyRate":40.0,"CancellationPolicyHours":5,"AverageRating":4.75000,"NumberOfRatings":4,"AverageResponseInMinutes":110,"TotalHours":6,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/5192f77c-3ff8-4928-bd5d-7512d4ccbe50.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/80585030","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am currently pursuing a Bachelor's degree in Statistics at UMBC. I have experience tutoring varying levels of math (from Algebra all the way through advanced Calculus) and statistics. I've tutored a wide range of ages from elementary school to college students, however the bulk of my experience is with middle and high school students. My favorite subjects to tutor are Calculus, Trigonometry, and of course Statistics. \r\nI have also tutored several students in SAT and ACT Math. When tutoring for these standardized test, I have found that my students are very successful when I practice test taking skills with them, along with the core math concepts. The key to getting a good score on these exams is practice ( a good tutor doesn't hurt either!). If you let me, I can help guide your student so they can achieve the score they desire. \r\n\r\nI have a strong passion for Math and Statistics. My admiration of the subject is what makes me a successful tutor. Many of my students used to tell me they hated math but it turned out that most of them hated it because it was a difficult subject that alluded them. It makes me beyond happy to see a student enjoy learning math, like I do, so I undoubtedly try my best to make sure all my students excel in their studies! \r\n\r\nI am flexible with scheduling and happy to make sure our sessions work well for you and your child. Please feel free to contact me with any questions, and to schedule lessons. I look forward to watching you or your child succeed! ","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland Baltimore County","UnderGradMajor":"Statistics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":3,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I completed Calculus 1, 2 and 3 with an \"A\" at UMBC. Also, I have tutored several students in AP Calculus and Business Calc. This can be a tricky subject for many people, however many of my students have told me that they actually grew to like Calculus once they understood it! "},{"TutorUserID":86265263,"FirstName":"Patricia","DisplayName":"Patricia T.","ZipCode":"21224","City":"Baltimore","StateAbbreviation":"MD","Headline":"Fun and Effective Math and Science Tutor","TypicalHourlyRate":50.0,"CancellationPolicyHours":36,"AverageRating":5.00000,"NumberOfRatings":3,"AverageResponseInMinutes":237,"TotalHours":4,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/92cdca5a-cacb-4f6d-a074-c094fc3ce35a.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/86265263","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Hi my name is Patricia. I have always had a fascination with math and science. These subjects offer a never-ending list of puzzles that are just waiting to be solved by any scientist or mathematician that is willing to put in the work. My fascination in math and science is a large part of who I am and that's why I tutor. Tutoring allows me to share my passion with other people and, ultimately, make the world a better place. Additionally, when I witness that sense of accomplishment on one of my student's faces, I can't help but get excited. My tutoring experience includes 7 years of helping students with a variety of subjects, including test-prep, calculus (and a lot of other math like Pre-calculus and Trigonometry), physics, biology, and chemistry. I have personally witnessed how challenging these subjects can be for some students, but my time as a student of the scientific discipline has made me well equipped to handle the difficulty. Along the way, I have picked up many great study skills that I will pass on to the scholars that I tutor. \n\nThrough participating in a vigorous engineering curriculum, I learned to critically think about different subjects and how they relate to each other, which I use to tutor and help students understand. I also aim to instill critical thinking techniques when teaching, allowing students to move away from memorization and towards logical thinking and problem solving, which in turn helps them retain the information and score better on exams.\n\nOver my 7 years of tutoring I try to incorporate a comfortable and fun environment to promote learning. I feel that the more comfortable one is when learning, the more beneficial the lesson will be. I try to build my students' confidence in order for them to feel comfortable asking questions and communicating their weaknesses. In this way I try to direct my teaching to each student's learning style and learning rate. I also try to promote good organization and study techniques, which I feel are important in order to focus one's attention and provide for clearer thinking. \n\nI'm currently working towards my MS in Mechanical Engineering and after I finish I plan to move on to obtain my PhD.\n\nI am confident that my experience will be well suited for your goals. Please feel free to contact me with any questions. I hope to hear from you soon and to help you reach your goals.","RatePolicyDetails":"Please ask about special rates.","HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland, Baltimore County","UnderGradMajor":"Mechanical Engineering","GraduateCollegeOne":"University of Maryland, Baltimore County","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":"Mount Vernon Square","TotalStudents":3,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":79367340,"FirstName":"Andre","DisplayName":"Andre K.","ZipCode":"21236","City":"Nottingham","StateAbbreviation":"MD","Headline":"At your service!","TypicalHourlyRate":50.0,"CancellationPolicyHours":1,"AverageRating":5.00000,"NumberOfRatings":5,"AverageResponseInMinutes":67,"TotalHours":14,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/cfea4d31-60ab-4cd8-9392-0b13b8187ff4.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/79367340","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I have been tutoring and teaching for 9+ years. I have worked with students from many different age groups, races, religions, and creeds. And, all of them have found success in their academic coursework as a result of my tutelage. My expertise ranges from Mathematics (Basic Math through Calculus, Linear Algebra, and Differential Equations), English, test preparation (ACT, SAT, GRE, etc.), and professional training (public speaking, report and proposal writing, and other career services). \n\nIf I am not in traveling distance of your home, I also offer online tutoring. I hope you decide to schedule an appointment with me!","RatePolicyDetails":"My rate is negotiable.","HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland, College Park","UnderGradMajor":"Mathematics and Economics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":4,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":86564731,"FirstName":"Mario","DisplayName":"Mario S.","ZipCode":"21218","City":"Baltimore","StateAbbreviation":"MD","Headline":"Physics and Mathematics tutor trained at Berkeley, CERN, VTech","TypicalHourlyRate":30.0,"CancellationPolicyHours":12,"AverageRating":4.00000,"NumberOfRatings":3,"AverageResponseInMinutes":1008,"TotalHours":4,"TravelRadiusInMiles":40,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/23bde0be-718a-4d3e-85f0-b0c097df652f.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/86564731","IsProfileVisible":true,"Visibility":1,"FreeResponse":"For the last five years I have been teaching physics (both algebra and calculus-based) as an instructor to students in Berkeley CA, Cincinnati OH, and the D.C. metro area, providing private one-on-one tutoring. I have been enjoying every minute of it. I consider myself personable and down to earth, and I have always received positive feedback from my students.\r\n\r\nPhysics is often viewed as memorizing a myriad of distinct equations, but that is a misunderstanding. Physics is more than just a list of equations; it is a methodology for describing how the world around us operates. Along the way you will inevitably come across various equations, and understanding where they come from, what they mean, and why we use them is the key to success.\r\n\r\nIt is no secret that in general students tend to forget much of what they learn in school down the road (too bad!), but in taking a physics course you will learn to develop your analytical thinking and problem-solving skills that will carry with you far beyond the class. If you simply wish to do well in your physics class, I am here to help you reach that goal. I have been involved with a wide variety of physics programs as well as students from all different walks of life, so I am confident in my ability to meet your specific tutoring needs.\r\n\r\nMy schedule is extremely flexible and I am willing to meet you wherever is most convenient, so please don't hesitate to contact me!\r\n","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Virginia Polytechnic Institute & State University (Virginia Tech)","UnderGradMajor":"Physics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":3,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":77963150,"FirstName":"Boyoung","DisplayName":"Boyoung C.","ZipCode":"21093","City":"Lutherville Timonium","StateAbbreviation":"MD","Headline":"Math & Science Tutoring","TypicalHourlyRate":40.0,"CancellationPolicyHours":24,"AverageRating":4.93532,"NumberOfRatings":201,"AverageResponseInMinutes":943,"TotalHours":730,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":"2015-01-30T17:41:04.86Z","BackgroundCheckStatus":2,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/8aba4498-8a49-49bf-8c38-6aafe47fb08a.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/77963150","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I majored Physics in my undergraduate and graduate study (U of Maryland,College Park). However, I got my Ph.D.  in Biophysics (Johns Hopkins University). Therefore, I have a very strong background to teach math and Physics. I taught Mathematical Physics at college as an instructor. \n\nI have many experiences in teaching Math and Science from middle school students to college/graduate school students. I am very patient and know how to teach different levels of students.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Yonsei University (Seoul/Korea)","UnderGradMajor":"Physics","GraduateCollegeOne":"University of Maryland (College Park)","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"The Johns Hopkins University","GraduateCollegeTwoDegree":"PhD","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":46,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":85911390,"FirstName":"Dennis","DisplayName":"Dennis Q.","ZipCode":"21093","City":"Lutherville Timonium","StateAbbreviation":"MD","Headline":"Retired high school math department chairman in BCPS","TypicalHourlyRate":65.0,"CancellationPolicyHours":3,"AverageRating":null,"NumberOfRatings":0,"AverageResponseInMinutes":null,"TotalHours":0,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/de1861bb-9e0a-4f5b-8a6b-3a388193db54.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/85911390","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I spent ten years at a Junior High. In 1973 I was named the math department chair. I was involved with creating and implementing the first gifted and talented mathematics program for Baltimore County. I taught the seventh grade program. In 1978 I became math chairman at the then new Owings Mills Junior-Senior High. In 1984 I was named math chairman at Catonsville High School. While at Catonsville, I taught GT precalculus, AB and BC Calculus and AP Statistics. I had a pass rate of about 90% on each of the three exams. I retired in 2006 and have been tutoring privately since then.\r\n\r\nI can tutor any academic math taught in high school as well as prepare students for the SAT math section and the math achievement test. I can also prepare students to take the AP examinations in Calculus and Statistics.\r\n\r\nI have the ability to explain mathematics to students who are struggling in mathematics. Not every student learns in the same way.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":null,"UnderGradMajor":null,"GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":0,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"Have taught and tutored AP Calculus (AB and BC) for 20 years."},{"TutorUserID":85442237,"FirstName":"Kitty","DisplayName":"Kitty B.","ZipCode":"21014","City":"Bel Air","StateAbbreviation":"MD","Headline":"Mathematics Tutor All subjects, all ages","TypicalHourlyRate":50.0,"CancellationPolicyHours":1,"AverageRating":4.83582,"NumberOfRatings":67,"AverageResponseInMinutes":null,"TotalHours":272,"TravelRadiusInMiles":6,"BackgroundCheckStatusDate":"2015-02-11T14:36:03.753Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://www.wyzant.com/images/tutor/silhouette.png","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/85442237","IsProfileVisible":true,"Visibility":1,"FreeResponse":"     I have been tutoring since 2005 and prior to having my own business, I have been a freelance math writer and taught in Baltimore County from grades 5-12.  I am currently certified by the Maryland State Department of Education in grades 5 -12, but I have tutored all ages including Harford Community College students.  I currently have over 30 hours beyond my Master's Degree.  I graduated from Towson State University with a B.S. in Mathematics/Secondary Education and from Johns Hopkins University with a M.S. in Technology.  \r\n      I have taught many levels of mathematics and a variety of students.  When meeting with a student, I assess their learning style and adapt my tutoring to the student's needs.  Tutoring is a partnership.  Your input as a parent is extremely valuable and any input the teacher can give is helpful.  I will keep you updated as tutoring progresses and I will make suggestions as appropriate.  Together, we will help your child succeed. \r\n\r\n\r\n\r\n","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Towson University","UnderGradMajor":"MathematicsEducation","GraduateCollegeOne":"Johns Hopkins","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":19,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":86727985,"FirstName":"Matthew","DisplayName":"Matthew B.","ZipCode":"21219","City":"Sparrows Point","StateAbbreviation":"MD","Headline":"Undergrad Math Tutor","TypicalHourlyRate":30.0,"CancellationPolicyHours":24,"AverageRating":5.00000,"NumberOfRatings":1,"AverageResponseInMinutes":516,"TotalHours":2,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/74295a9c-892e-4241-937e-6ef24c7df4ca.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/86727985","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am currently enrolled at University of Maryland Baltimore County (UMBC). I am in my senior year of my undergrad program and I am majoring in Mathematics. During college, I have helped students in pre-calculus and I was a grader for two linear algebra classes.  I love helping students learn Math and hope they can find enjoyment from it like I do.\n\nACT Math Score - 36\nSAT Math Score - 740\nAP Exam Scores - Calculus AB (5), Calculus BC (5), Statistics (4)\nI have taken and passed:\nLinear Algebra\nDifferential Equations\nCalculus 3\nIntro to Analysis I&II","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"UMBC (University of Maryland Baltimore County)","UnderGradMajor":"Mathematics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":1,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I took Calculus in high school and received an A grade. I have received a score of 5 on both AP tests (Calc AB and Calc BC)."},{"TutorUserID":86625421,"FirstName":"Jarrett","DisplayName":"Jarrett P.","ZipCode":"21227","City":"Halethorpe","StateAbbreviation":"MD","Headline":"Patient Engineer Making STEM Accessible To You!","TypicalHourlyRate":40.0,"CancellationPolicyHours":2,"AverageRating":4.57692,"NumberOfRatings":26,"AverageResponseInMinutes":82,"TotalHours":93,"TravelRadiusInMiles":25,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/7134d1d8-45b2-4e6a-a94c-be3f29642b04.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/86625421","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a major proponent of life long learning, and want to foster that joy of exploration in all of the students I work with. As a dedicated engineering professional the areas of Math and Applied Science are personal passions. I love breaking down what many people consider complex ideas into easily accessible concepts that can be further built upon for success.\r\n\r\nI have worked as a tutor and teacher's assistant at the High School and Collegiate Level in the areas of Math, Chemistry, Physics, Computer Aided Design, and Mechanical Engineering.\r\n\r\nI served as a departmental tutor while in college to assist students in early college math courses, and worked as a private math tutor to the children  of a number of the university professors.\r\n\r\nI've completed math courses up to Partial Differential Equations and Discrete Math at the graduate level.\r\n\r\nI've taken collegiate Physics and Chemistry. I have also worked as a laboratory assistant for both of these subjects, and tutored physics.\r\n\r\nI have completed a bachelors degree in Mechanical Engineering as well as some graduate course work focusing on control system development. While in graduate school I taught Computer Aided Design, served as a senior graduate design consultant, and tutored for undergraduate courses. I have also worked as a professional engineer for the last 4 years, and further refined and developed the skills I built in school.\r\n\r\nI seek to challenge the student during every session, but the goal is always to buildup the student to be the best scholar they can be.\r\n\r\nI look forward to hearing from you, and helping you achieve new scholastic heights!","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"North Carolina A & T State University","UnderGradMajor":"Mechanical Engineeri","GraduateCollegeOne":"North Carolina A & T State University","GraduateCollegeOneDegree":"Graduate Coursework","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":6,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":null,"MatchingSearchedForSubjectName":null,"MatchingSearchedForSubjectQualification":null},{"TutorUserID":82783870,"FirstName":"Jessica","DisplayName":"Jessica K.","ZipCode":"21219","City":"Sparrows Point","StateAbbreviation":"MD","Headline":"Math and Science Tutor","TypicalHourlyRate":40.0,"CancellationPolicyHours":2,"AverageRating":4.50000,"NumberOfRatings":2,"AverageResponseInMinutes":24,"TotalHours":7,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":true,"ProfilePictureURL":"https://www.wyzant.com/images/tutor/silhouette.png","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/82783870","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a graduating math major at Towson University. I took up to AP Calculus AB in high school and have now finished all of my math major classes in college. I tutor through the university during the school year and independently all year on the side. I have also taken many biology classes and would be able to tutor in that, especially genetics and microbiology. I am also able to tutor in French. My favorite class and subject to tutor is Calculus 1. I have been tutoring for four years and have learned many different techniques for teaching concepts to students. Many of the students come back to me and tell me how much I have helped them pass tests and classes and how much better they understood the material.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"Towson University","UnderGradMajor":"Applied Mathematics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":3,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I took AP calculus in high school. I took calculus 2 and 3 in college "},{"TutorUserID":86624790,"FirstName":"Nick","DisplayName":"Nick C.","ZipCode":"21043","City":"Ellicott City","StateAbbreviation":"MD","Headline":"Nick C. (Montgomery County, MD)","TypicalHourlyRate":60.0,"CancellationPolicyHours":null,"AverageRating":5.00000,"NumberOfRatings":2,"AverageResponseInMinutes":514,"TotalHours":17,"TravelRadiusInMiles":40,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/dd36a6ce-c0b8-4492-a529-50de4cbe7cf4.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/86624790","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Hello,\n\nMy name is Nick and I am a recent graduate and former Calculus tutor at The University of Maryland College Park. I graduated with a degree in Chemical and Biomolecular engineer last May. I was hired by the university as a Calculus tutor with open walk in hours. In addition to that I have done private tutoring for several years. I mostly specialize in Math but can also tutor Chemistry, Biology, and other physical sciences.  \n\nI am an experienced math tutor who can work with students of all mathematical ability.  \n\nIf interested please email me with your name, name of the course, and the text book and author being used for the class. \n\nNick C.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"B.A. University of Maryland","UnderGradMajor":"Chemical Engineering","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":4,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null}]}