{"TotalResultsCount":51,"ResultsPage":[{"TutorUserID":72828310,"FirstName":"Meredith","DisplayName":"Meredith D.","ZipCode":"21218","City":"Baltimore","StateAbbreviation":"MD","Headline":"Tutor with Extensive Special Needs Experience","TypicalHourlyRate":75.0,"CancellationPolicyHours":8,"AverageRating":4.95151,"NumberOfRatings":598,"AverageResponseInMinutes":857,"TotalHours":1823,"TravelRadiusInMiles":30,"BackgroundCheckStatusDate":"2013-12-04T23:31:05.14Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/47926eb6-d409-4ae4-9470-54c1c1a28179.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/72828310","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Educational background: \n\nI received my B.S. in Biology with a minor in Physical Science (physics and chemistry) from Bob Jones University in 2005.\n\n\nWork experience:\n\nI have worked as a tutor and teacher for 12 years. During my college career, I tutored college students in biology, chemistry, and algebra. I also tutored high school algebra, chemistry, and biology while I pursued my undergraduate education.\n\nAfter I received my Bachelor's degree, I worked for one year as a high school algebra, chemistry, physics, and physical science teacher for students in 8th-12th grade. I also worked as an after school tutor for 2nd through 12th graders in math and chemistry.\n\nI have extensive experience working with children and adults with special needs. I have worked with individuals who have disabilities and special needs for 14 years in roles including camp counselor, lifeguard, in home support specialist, respite care provider, horseback riding instructor, teacher, and tutor.\n\nI have several years of experience with the IEP process for students with special needs and I greatly enjoy working with children and teenagers with special needs who have focus and attention issues as well as handwriting problems. I am pursuing certification as a handwriting specialist through Handwriting Without Tears for pre-k through cursive handwriting development.\n\nI am also certified at the registered level through the North American Riding for the Handicapped Association (NARHA) as a therapeutic horseback riding instructor, and I have extensive experience working with children and adults with autism, brain injury, cerebral palsy, and developmental disabilities.\n\nTeaching style:\n\nI use a multi-faceted teaching style, realizing that every student is different and every student's needs are unique. I have found through my experience that it is best to combine visual, auditory, and hands-on, experiential teaching methods in order to provide a teaching and learning experience that will grasp the attention of the child and help him or her to retain the learning for life rather than just memorizing it for a test or for one class. Learning is meant to be retained and to be utilized in building skills for life.","RatePolicyDetails":"Discounted rate available for students who refer new students or for groups of 2 or more students.","HasAvailableTimeSlots":true,"UnderGradCollege":"Bob Jones University, B.S. Biology","UnderGradMajor":"Biology","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":113,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":80670200,"FirstName":"Clayton","DisplayName":"Clayton L.","ZipCode":"21227","City":"Halethorpe","StateAbbreviation":"MD","Headline":"Math Tutor","TypicalHourlyRate":60.0,"CancellationPolicyHours":4,"AverageRating":4.93197,"NumberOfRatings":147,"AverageResponseInMinutes":1138,"TotalHours":362,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-09-02T02:41:02.783Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/9563f627-3e05-4405-80de-94a2f5683846.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/80670200","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I have always loved math, and understood why others despise it. My father programmed computers, my mother programmed students as a math teacher. They taught me well and inspired within me a love of learning. The oldest of four spanned over seven years, I was helping my siblings with their homework starting in elementary school. In high school, I coached my middle school's math team because my coach decided he needed more time with his family. I have graduated from UMBC with a B.S. in mathematics, and I plan on teaching at a high school level. I have tutored college students through the university for calculus and precalculus. I know the difference between doing work for a student and actually helping someone learn difficult material. I worked at Mathnasium of Ellicott City, Rockville, and Germantown for two years.  I have thousands of hours of experience teaching math of all levels.  I feel best when I see eyes light up with understanding, and I strive to make that happen every day.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland, Baltimore County","UnderGradMajor":"Mathematics","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"Graduate Coursework","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":34,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have tutored calculus while I was in college and at the math learning center where I worked.  I took calculus in one form or another at least six times throughout my schooling career."},{"TutorUserID":86554338,"FirstName":"Craig","DisplayName":"Craig F.","ZipCode":"21209","City":"Baltimore","StateAbbreviation":"MD","Headline":"Mathematician and magician","TypicalHourlyRate":40.0,"CancellationPolicyHours":12,"AverageRating":5.00000,"NumberOfRatings":14,"AverageResponseInMinutes":272,"TotalHours":57,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-10-09T14:36:02.48Z","BackgroundCheckStatus":2,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/5047eb4f-6bc4-4282-9626-2832211c573b.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/86554338","IsProfileVisible":true,"Visibility":1,"FreeResponse":"My ultimate goal as a tutor is to help my students feel comfortable enough with their studies so that they no longer need me to help them anymore.\n\nI am an actuary with 16+ years work experience with the US government. I have taught mathematics and statistics in college, but I enjoy tutoring a lot more than teaching; I don't like having to give grades to students and would much rather help them earn good grades. I have been tutoring mathematics since 1987. I am also a part-time professional magician.\n\nI tutor middle school math, high school math, and most college mathematics and statistics.\n\nThe best way to learn mathematics is by doing mathematics problems. My role as a tutor is similar to that of a coach; the student does the mathematics problem, while I give him or her pointers along the way. Once the student is able to demonstrate that he or she knows how to solve the math problem, I then ask questions to the student in order to facilitate critical thinking. This is in order to ensure that the student actually understands what he or she is doing and isn't just going through the motions.\n\nI am available in the evenings Sunday, Monday, Tuesday, Wednesday, Thursday. Also, I am available during the day on Sunday. I like to meet my students in public libraries, so they can be inspired to do great.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland Baltimore County","UnderGradMajor":"Mathematics","GraduateCollegeOne":"Syracuse University","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"Johns Hopkins University","GraduateCollegeTwoDegree":"Master's","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":14,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have a master's degree in pure math from Syracuse U and a master's degree in applied math from Johns Hopkins U. I am also an actuary who passed all of the exams required for Associate of the Society of Actuaries. Knowledge of calculus is essential for this."},{"TutorUserID":77528900,"FirstName":"Miriam","DisplayName":"Miriam S.","ZipCode":"21236","City":"Nottingham","StateAbbreviation":"MD","Headline":"Experienced Teacher of German and Math: Pre-Algebra through Calculus","TypicalHourlyRate":60.0,"CancellationPolicyHours":6,"AverageRating":4.87500,"NumberOfRatings":40,"AverageResponseInMinutes":null,"TotalHours":85,"TravelRadiusInMiles":8,"BackgroundCheckStatusDate":"2014-11-02T19:31:04.597Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/a1c827e4-036b-48e7-a483-d30bb53d65d2.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/77528900","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a certified secondary math teacher with experience teaching everything from Pre-Algebra through Calculus.  I have taught both middle school and high school in Baltimore County Public Schools and in private schools in the Baltimore area.  I hold a Master's Degree in Curriculum and Instruction.\nI also offer tutoring in German for any age, children through adults for school, travel, or work.\n\nTutoring sessions will be held at a branch of the public library.  I am available evenings and weekends throughout the year.","RatePolicyDetails":"Please ask me about reduced prices for multiple students taking the same course.","HasAvailableTimeSlots":true,"UnderGradCollege":"Virginia Tech","UnderGradMajor":"Engineering","GraduateCollegeOne":"Loyola University--Baltimore MD","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":10,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"I have 3 years of experience teaching AP Calculus AB.  I can tutor you to be more successful in your high school calculus class or just help you review for the AP Calculus AB exam."},{"TutorUserID":79996710,"FirstName":"Keith","DisplayName":"Keith L.","ZipCode":"21146","City":"Severna Park","StateAbbreviation":"MD","Headline":"Professor available to tutor in Math, Science and Engineering","TypicalHourlyRate":85.0,"CancellationPolicyHours":5,"AverageRating":4.98138,"NumberOfRatings":376,"AverageResponseInMinutes":5,"TotalHours":876,"TravelRadiusInMiles":15,"BackgroundCheckStatusDate":null,"BackgroundCheckStatus":1,"IsOnlineCertified":false,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/031f0038-5389-4de0-882c-60db62f2f63a.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/79996710","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a 60 year-old Mechanical Engineering Professor at the U.S. Naval Academy.  I have a PhD in mechanical engineering from the University of Maryland.  I have 8 years of teaching experience at the University of Maryland and 31 years at the U.S. Naval Academy.  As a Professor, I have hundreds of hours of experience working with students one on one as well as countless hours of tutoring my own very successful children when they were young.\n\nRecently, I have had great success helping students significantly improve their Math SAT scores.  I am willing to tutor any math class, K-12, any calculus class, math SAT prep, math ACT prep and some college classes such as Statics, Dynamics, and Thermodynamics.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Maryland","UnderGradMajor":"Mechanical Engr","GraduateCollegeOne":"University of Maryland","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":"University of Maryland","GraduateCollegeTwoDegree":"PhD","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":90,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"As an engineering professor, I use calculus often and provide one to one tutoring to my engineering students."},{"TutorUserID":85364927,"FirstName":"John","DisplayName":"John T.","ZipCode":"21043","City":"Ellicott City","StateAbbreviation":"MD","Headline":"Doctoral-level tutoring for Maths, Stats, Sciences, SAT/ACT, and GRE","TypicalHourlyRate":65.0,"CancellationPolicyHours":4,"AverageRating":4.92415,"NumberOfRatings":646,"AverageResponseInMinutes":229,"TotalHours":2219,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-03-30T12:11:03.357Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/61550638-35a5-4dfe-a78a-8edde8f01c22.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/85364927","IsProfileVisible":true,"Visibility":1,"FreeResponse":"*****************************************************\nLimited availability right now. The availability I have on the site\nis up-to-date. Contact me for details.\n*****************************************************\n\nJohn has a passion for working with people who endeavor to learn and develop their intellects and is listed among the Wyzant Top 100 Tutors for 2015.\n\nBackground: John grew up in Northeast Kansas working on farms since the age of 11. He graduated from a small rural high school and earned his BS and PhD degrees in biological sciences from the University of Kansas. An award-winning instructor, John taught extensively on the undergraduate and graduate level during his PhD program. While a Cancer Prevention Fellow with the National Cancer Institute, John earned his Master of Public Health degree from Johns Hopkins University. As a Fellow, John completed four years of mentored research in the NCI's Laboratory of Metabolism where he applied mass spectrometry-based metabolomics to radiation biomarker development. He then joined the faculty of the Department of Biochemistry and Cellular & Molecular Biology at the Georgetown University. During these years, John was recognized multiple times for the quality of his research. His seminal publications in radiation metabolomics research have been cited over 400 times in the peer-reviewed literature. \n\nCurrently: John works as a public health research consultant and also tutors extensively. Since his start in November 2013, he logged nearly 500 hours of one-on-one tutoring with StudyPoint Inc. Before leaving the company to work independently, John was promoted to the distinguished level of Tutor Premiere. John is now writing advanced study guides for the ACT, SAT, and GRE, based on his more than 1,000 hours of one-on-one test prep tutoring experience. He currently teaches SAT and ACT classes at a test prep academy in Ellicott City. \n\nJohn's philosophy is based on creating and maintaining a healthy lifestyle of learning. \"How we spend our time determines what we are good at. If we spend our time on entertainment, then we will be great at being entertained. But if we spend our time solving problems, then we will become extraordinary problem-solvers.\" John takes a holistic approach to tutoring by addressing habits and lifestyle as well as academic performance. John always begins a tutoring relationship by learning about his students' habits and lifestyles and offering recommendations for changes. Establishing an optimal lifestyle of learning is foundational to achieving academic excellence.\n\nIn his \"copious\" free time, John enjoys being with his two children (above all else), studying theology and philosophy, volunteering to help the poor, and riding his bicycles and motorcycles. His ultimate mission is to leave a strong legacy of contribution for not only his own kids but all children and adults engaged in the pursuit of knowledge.","RatePolicyDetails":"Minimum 60 min session to ensure I can defray travel costs. Discount for online sessions.","HasAvailableTimeSlots":true,"UnderGradCollege":"University of Kansas","UnderGradMajor":"BS, Organismal Biology","GraduateCollegeOne":"University of Kansas","GraduateCollegeOneDegree":"PhD","GraduateCollegeTwo":"Johns Hopkins University","GraduateCollegeTwoDegree":"Master's","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":185,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":85317911,"FirstName":"Doug","DisplayName":"Doug H.","ZipCode":"21043","City":"Ellicott City","StateAbbreviation":"MD","Headline":"Math, Physics and Computer Science tutoring by Stanford grad","TypicalHourlyRate":50.0,"CancellationPolicyHours":1,"AverageRating":4.98511,"NumberOfRatings":403,"AverageResponseInMinutes":54,"TotalHours":878,"TravelRadiusInMiles":5,"BackgroundCheckStatusDate":"2015-04-27T03:21:04.073Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/cea9461e-2606-439a-869c-f614f82ed85f.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/85317911","IsProfileVisible":true,"Visibility":1,"FreeResponse":"Looking for extra help with high school math or physics, or college computer science?  Perhaps that AP Calculus exam is looking like a challenge, or your son or daughter would like to improve their SAT scores?   I have helped a number of local students make sense of math or physics...check out my reviews and ratings.  It's so great when I hear my students tell me they got an A on a big test, a 5 on an AP exam, a 1440 on their SAT, or they passed that hard mandatory class for their major.  I have a Master's in Computer Science from Stanford, and enjoy helping people learn about math and computer science, as well as related subjects like physics and SAT prep.  \n\nMy specialties include high school honors and AP classes like calculus and physics, as well as college  classes for discrete math, computer architecture, algorithms and programming.   If you find yourself struggling with a challenging math class or challenging teacher, or just need a refresher in algebra, geometry,  trigonometry,  probability and statistics, or precalc to get through more advanced math, I would be a great choice to help you.  My students appreciate my  approach with lots of patience and positive reinforcement.   \n\nI have a flexible schedule, and can meet you or your student after school, or during the day if that's more convenient.  Most of my students meet with me either at the  library or in their home.  At this point, I have a number of regular weekly clients who get priority for future appointments, so not all times shown in the availability list below are schedulable for new clients, but I would be happy to work with you to find a time that would work for you.\n\nMy preference is to work with students who want to improve performance in a class or for a standardized test over a series of regular sessions, as opposed to one-time help for a class assignment or test.   You might reasonably expect a one-letter grade improvement from weekly meetings over an eight week period; of course, that varies with the student, subject, and situation, so is a goal rather than a guarantee.","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"University of Michigan","UnderGradMajor":"Computer Engineering","GraduateCollegeOne":"Stanford","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":120,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":"Calculus is one of the most popular choices for my students, particularly AP AB and honors calculus involving the mathematics of the infinitesimal: limits, derivatives, integrals, and related topics like exponential and logarithmic functions.   I have worked with many students to help them get through quizzes, midterms, finals and the AP exam.  I would be happy to help you, too!"},{"TutorUserID":85487170,"FirstName":"Nikia","DisplayName":"Nikia K.","ZipCode":"21057","City":"Glen Arm","StateAbbreviation":"MD","Headline":"Patient Teacher for Mathematics","TypicalHourlyRate":42.0,"CancellationPolicyHours":3,"AverageRating":4.88608,"NumberOfRatings":79,"AverageResponseInMinutes":131,"TotalHours":279,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2015-03-10T22:31:05.253Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/e79a6ebc-a1ef-4d28-a765-34e1ddc14214.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/85487170","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I am a secondary mathematics teacher with an advanced professional teaching certificate and six years of experience. I also have eleven years of tutoring experience. As an undergraduate student, I took on tutoring as a part time job and I have loved tutoring ever since. It brings me joy to share my knowledge with students and to experience the \"ah ha!\" moments with them as concepts begin to make sense.\r\n\r\nMy specialty is in tutoring various levels of mathematics. Whether we are working on basic math or differentiating functions, my goals are to ease each student into the content and challenge them all while minimizing any possible anxiety. My priority in each session is to ensure the student's success. Prior to meeting with each student, I like to gather information about strengths, weaknesses and goals for the purpose of maximizing time during each session. I am attentive, patient, and will work through each problem until the student feels comfortable and confident enough to work independently. \r\n\r\nTutoring is my passion and I look forward to helping you reach your goals.","RatePolicyDetails":"A one hour session fee will be assessed to the student's account in the event the session is cancelled with less than 3 hours notice.","HasAvailableTimeSlots":true,"UnderGradCollege":"Morgan State University, Baltimore, Maryland","UnderGradMajor":"Mathematics","GraduateCollegeOne":"Towson University Towson MD","GraduateCollegeOneDegree":"Master's","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":17,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":76086620,"FirstName":"Ryan","DisplayName":"Ryan N.","ZipCode":"21044","City":"Columbia","StateAbbreviation":"MD","Headline":"Math and Stat tutoring from elementary to college-level concepts","TypicalHourlyRate":60.0,"CancellationPolicyHours":8,"AverageRating":4.91028,"NumberOfRatings":457,"AverageResponseInMinutes":78,"TotalHours":1676,"TravelRadiusInMiles":20,"BackgroundCheckStatusDate":"2016-08-18T14:06:03.413Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/8a4f3f52-dc96-4e18-9738-1ebcebe322d9.jpg","TeachingFormatPreference":3,"PublicProfileURL":"/match/tutor/76086620","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I completed a Bachelor's degree in statistics at North Carolina State University in May 2010, and proceeded to take a few graduate mathematics and statistics courses.  Tutoring has been my primary focus since 2011.  I have tutored mathematical subjects ranging from elementary math to calculus (univariate and multivariate), linear algebra, differential equations, real analysis, and advanced statistics courses (e.g. mathematical statistics, biostatistics, machine learning, advanced probability), and have tutored ages ranging from very young children to nontraditional adult students.\n\nAside from math and statistics, I have also taught guitar performance and music theory at the Burton School of Arts from 2008-2011, and I am looking to begin tutoring English, composition, and rhetoric at the high school level. \n\nI empathize with students who are frustrated with mathematical coursework and concepts, and incorporate a supportive manner in my teaching style. This applies especially to students with learning disabilities, or otherwise unique learning styles that may be less compatible with a traditional classroom learning environment.  If you are frustrated and feel that you simply can't grasp these concepts, rest assured that it is possible, and having someone work one-on-one with you will help address your specific concerns and weaknesses.  Often, it's just a matter of having someone explain the concepts in a different way, then walking you through a few examples.\n\nThanks for looking at my profile, and I hope you'll give me a chance to help you!","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"North Carolina State University","UnderGradMajor":"Statistics","GraduateCollegeOne":"North Carolina State University","GraduateCollegeOneDegree":"Graduate Coursework","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"Graduate Coursework","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":164,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null},{"TutorUserID":84504010,"FirstName":"Jessica","DisplayName":"Jessica H.","ZipCode":"21228","City":"Catonsville","StateAbbreviation":"MD","Headline":"Science, Math, and Engineering ","TypicalHourlyRate":40.0,"CancellationPolicyHours":10,"AverageRating":4.90476,"NumberOfRatings":42,"AverageResponseInMinutes":664,"TotalHours":123,"TravelRadiusInMiles":10,"BackgroundCheckStatusDate":"2015-09-08T01:46:04.55Z","BackgroundCheckStatus":2,"IsOnlineCertified":true,"ProfilePictureURL":"https://dj1hlxw0wr920.cloudfront.net/userfiles/wyzfiles/82f51bb4-10eb-4bb8-b0a1-50971c312707.jpg","TeachingFormatPreference":1,"PublicProfileURL":"/match/tutor/84504010","IsProfileVisible":true,"Visibility":1,"FreeResponse":"I have been tutoring ever since I was a freshman in high school. I had the opportunity to tutor kids at my local church with Vietnamese and English for 2 years. Also, I was involved in National Honor Society, specifically in the tutoring committee. I had tutor several students after school. All of the students that I tutored had told me that their scores on tests improved. \n\nWe all learn in different ways. Some of us learn through visual, or hearing, or touching, or all three combinations. It is my responsibility to determine which method best suited for each student and to teach them best strategies in order to achieve their full academic potential. \n\nI always encourage students to do better by saying \"You can do this! I believe in you!\". I feel very satisfied when students understand concepts that they have troubled with because this makes me know that I am doing my job right. I love watching students grow and become more confident as mathematicians, writers, problem solvers, and people. \n\nI took a lot of AP Classes during my high school career, such as AP Chemistry, AP Calculus AB/BC, AP Psychology, AP American Government, and so on. I have a lot of knowledge and willingly to share with you! I graduated from Harford Community College with Associates Degree of Science in Engineering. I'm transferring to University of Maryland, Baltimore County in Spring 2016 for Chemical Engineering. I'm very flexible with my tutoring schedule and you can cancel the tutor session within 10 hour ahead of notice. Please contact me for more detail!","RatePolicyDetails":null,"HasAvailableTimeSlots":true,"UnderGradCollege":"UMBC (University of Maryland, Baltimore County)","UnderGradMajor":"Chemical Engineering","GraduateCollegeOne":null,"GraduateCollegeOneDegree":"0","GraduateCollegeTwo":null,"GraduateCollegeTwoDegree":"0","StudentHasARelationshipWithTutor":false,"TimeZoneID":5,"DaylightSavingsTime":true,"Neighborhood":null,"TotalStudents":15,"TimeZoneName":"America/New_York","MatchingSearchedForSubjectId":96,"MatchingSearchedForSubjectName":"calculus","MatchingSearchedForSubjectQualification":null}]}